pmo-dataset/graphviz/02.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Post job description" -> "Collect resumes";
  "Choose candidate" -> "Extend offer";
  "Negotiate salary" -> "ExclusiveGateway_3";
  "Screen resumes" -> "Conduct initial\nphone interviews";
  "Conduct initial\nphone interviews" -> "Invite candidates\nfor interviews";
  "ExclusiveGateway_2" -> "Choose candidate";
  "ExclusiveGateway_6" -> "ExclusiveGateway_5";
  "ParallelGateway_1" -> "Complete orientation";
  "Complete orientation" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Complete paperwork";
  "ExclusiveGateway_1" -> "Conduct a virtual\ninterview";
  "Extend offer" -> "ExclusiveGateway_6";
  "ParallelGateway_2" -> "end";
  "ExclusiveGateway_1" -> "Conduct an in-person\ninterview";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4";
  "Conduct an in-person\ninterview" -> "ExclusiveGateway_2";
  "Conduct a virtual\ninterview" -> "ExclusiveGateway_2";
  "ParallelGateway_1" -> "Complete training";
  "Collect resumes" -> "Screen resumes";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Complete training" -> "ParallelGateway_2";
  "Create job\ndescription" -> "Post job description";
  "Invite candidates\nfor interviews" -> "ExclusiveGateway_1";
  "Complete paperwork" -> "ParallelGateway_2";
  "ExclusiveGateway_4" -> "Negotiate salary";
  "ExclusiveGateway_5" -> "Begin onboarding\nprocess";
  "ExclusiveGateway_3" -> "ExclusiveGateway_5";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "Identify need for\nnew hire" -> "Create job\ndescription";
  "start" -> "Identify need for\nnew hire";
  "Begin onboarding\nprocess" -> "ParallelGateway_1";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
